{
  "hello_there": [
    {
      "t": "Welcome to Toard",
      "ts": 1639575229137,
      "d": "Toard is a open source social Bulletin board, That used to discuss some stuff in real, internet, Music, or tech."
    },
    {
      "t": "What is Toard?",
      "ts": 1639575229137,
      "d": "Toard is a Text only Bulletin board. And it's supposed to be anonymous for everyone. No registration is required, 0% Javascript is included in frontend.\n\nToard is written in Javascript (NodeJS)"
    },
    {
      "t": "Is Toard 4chan clone?",
      "ts": 1639575229137,
      "d": "4chan is a Image bulletin board, While Toard is a complete text-only bulletin board. Both is different when you see of how it works."
    },
    {
      "t": "How to create a post?",
      "ts": 1639575229137,
      "d": "You see a button at the near top bar? Press it. You need to write your post title, and your description. Same as how do you reply to a post."
    },
    {
      "t": "Where's the source code?",
      "ts": 1639575229137,
      "d": "https://github.com/Yonle/Toard"
    },
    {
      "t": "Need API to build your own Toard Client?",
      "ts": 1639575229137,
      "d": "See /toard_api Endpoint"
    }
  ],
  "toard_api": [
    {
      "t": "Toard API",
      "ts": 1639575229137,
      "d": "A short documentation of Toard API, Used for creating your own Toard Client, and etc. The API respond in JSON format, So you need to have a prepared JSON parser in your client."
    },
    {
      "t": "/api/[id]",
      "ts": 1639575229137,
      "d": "A endpoint to fetch all Threads / Replies. When you didn't provide a thread ID, The endpoint will returns all Threads with it's Replies."
    },
    {
      "t": "/create",
      "ts": 1639575229137,
      "d": "A endpoint to create a thread.\nThis Endpoint only work in POST method, and requires two POST data.\n\n- t\nPost title\n\n- d\nPost Description\n\nExample POST Data:\n\nt=Guys, How can i cook a pancake?\nd=I would like to know how to cook a pancake. I found a post describing how to cook a pancake, But that never work."
    },
    {
      "t": "/[id]/reply",
      "ts": 1639575229137,
      "d": "Same as /create endpoint, But it's used for replying a thread."
    }
  ]
}
